ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/LFSS_1.0.xml
        </group>
    <group id="LFSS_FUPDATE" name="LFSS_FUPDATE" instances="1" offset="0x204" instaddr="0x1FC" description="">
        <register id="LFSS_FUPDATE_RTC_OUT" width="32" offset="0x0" description="FUPDATE version of RTC_OUT">
            <bitfield id="IOADDR" description="IO Address. This is the address that corresponds to the SOC address[27:2] of the module IP instance specific IO signal in the Full Write subregion of the pinmux subregion." begin="27" end="2" width="26" rwaccess="R/W">
            </bitfield>
            <bitfield id="LOCK" description="Sets lock bit" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOEFFECT" value="0x0" description="Writing this value has no effect"/>
                <bitenum id="LOCK" value="0x1" description="Set channel lock bit"/>
            </bitfield>
            <bitfield id="GSEL" description="GPIO channel Select 0: Select the P-Channel for the F update 1: Select the G-Channel for the F update" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="PCHAN" value="0x0" description="Select the P-Channel for the F update"/>
                <bitenum id="GCHAN" value="0x1" description="Select the G-Channel for the F update"/>
            </bitfield>
        </register>
        </group>
    <register id="LFSS_FSUB_0" width="32" offset="0x400" description="Subscriber Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-255 = connected to channelID = CHANID." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Consult your device datasheet as the actual allowed maximum may be less than 255."/>
        </bitfield>
    </register>
    <register id="LFSS_FPUB_0" width="32" offset="0x440" description="Publisher Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Consult your device datasheet as the actual allowed maximum may be less than 255."/>
        </bitfield>
    </register>
    <register id="LFSS_CPU_CONNECT_0" width="32" offset="0x480" description="CPU Connect">
    </register>
    <register id="LFSS_CLKSEL" width="32" offset="0x1004" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="LFCLK_SEL" description="Selects LFCLK as clock source if enabled" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="LFCLK is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="LFCLK is enabled"/>
        </bitfield>
    </register>
    <group id="LFSS_CPU_INT" name="LFSS_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="LFSS_CPU_INT_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="RTCRDY" value="0x1" description="RTC ready"/>
                <bitenum id="RTCTEV" value="0x2" description="RTC time event"/>
                <bitenum id="RTCA1" value="0x3" description="RTC alarm 1"/>
                <bitenum id="RTCA2" value="0x4" description="RTC alarm 2"/>
                <bitenum id="RT0PS" value="0x5" description="RTC prescale timer 0"/>
                <bitenum id="RT1PS" value="0x6" description="RTC prescale timer 1"/>
                <bitenum id="RT2PS" value="0x7" description="RTC prescale timer 2"/>
                <bitenum id="TSEVT" value="0x8" description="Time stamp event"/>
                <bitenum id="TIO0" value="0x9" description="Tamper I/O 0 event"/>
                <bitenum id="TIO1" value="0xA" description="Tamper I/O 1 event"/>
                <bitenum id="TIO2" value="0xB" description="Tamper I/O 2 event"/>
                <bitenum id="TIO3" value="0xC" description="Tamper I/O 3 event"/>
                <bitenum id="TIO4" value="0xD" description="Tamper I/O 4 event"/>
                <bitenum id="TIO5" value="0xE" description="Tamper I/O 5 event"/>
                <bitenum id="TIO6" value="0xF" description="Tamper I/O 6 event"/>
                <bitenum id="TIO7" value="0x10" description="Tamper I/O 7 event"/>
                <bitenum id="TIO8" value="0x11" description="Tamper I/O 8 event"/>
                <bitenum id="TIO9" value="0x12" description="Tamper I/O 9 event"/>
                <bitenum id="TIO10" value="0x13" description="Tamper I/O 10 event"/>
                <bitenum id="TIO11" value="0x14" description="Tamper I/O 11 event"/>
                <bitenum id="TIO12" value="0x15" description="Tamper I/O 12 event"/>
                <bitenum id="TIO13" value="0x16" description="Tamper I/O 13 event"/>
                <bitenum id="TIO14" value="0x17" description="Tamper I/O 14 event"/>
                <bitenum id="TIO15" value="0x18" description="Tamper I/O 15 event"/>
            </bitfield>
        </register>
        <register id="LFSS_CPU_INT_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RTCRDY" description="RTC ready" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCTEV" description="RTC time event" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCA1" description="RTC alarm 1" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCA2" description="RTC alarm 2" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RT0PS" description="RTC prescale timer 0" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RT1PS" description="RTC prescale timer 1" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RT2PS" description="RTC prescale timer 2" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TSEVT" description="Time stamp event" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO0" description="Tamper I/O 0 event" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO1" description="Tamper I/O 1 event" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO2" description="Tamper I/O 2 event" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO3" description="Tamper I/O 3 event" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO4" description="Tamper I/O 4 event" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO5" description="Tamper I/O 5 event" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO6" description="Tamper I/O 6 event" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO7" description="Tamper I/O 7 event" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO8" description="Tamper I/O 8 event" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO9" description="Tamper I/O 9 event" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO10" description="Tamper I/O 10 event" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO11" description="Tamper I/O 11 event" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO12" description="Tamper I/O 12 event" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO13" description="Tamper I/O 13 event" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO14" description="Tamper I/O 14 event" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIO15" description="Tamper I/O 15 event" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
        </register>
        <register id="LFSS_CPU_INT_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RTCRDY" description="RTC ready" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RTCTEV" description="RTC time event" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RTCA1" description="RTC alarm 1" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RTCA2" description="RTC alarm 2" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RT0PS" description="RTC prescale timer 0" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RT1PS" description="RTC prescale timer 1" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="RT2PS" description="RTC prescale timer 2" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TSEVT" description="Time stamp event" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO0" description="Tamper I/O 0 event" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO1" description="Tamper I/O 1 event" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO2" description="Tamper I/O 2 event" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO3" description="Tamper I/O 3 event" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO4" description="Tamper I/O 4 event" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO5" description="Tamper I/O 5 event" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO6" description="Tamper I/O 6 event" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO7" description="Tamper I/O 7 event" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO8" description="Tamper I/O 8 event" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO9" description="Tamper I/O 9 event" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO10" description="Tamper I/O 10 event" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO11" description="Tamper I/O 11 event" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO12" description="Tamper I/O 12 event" begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO13" description="Tamper I/O 13 event" begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO14" description="Tamper I/O 14 event" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
            <bitfield id="TIO15" description="Tamper I/O 15 event" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
